{
  "header": {
    "name": "Andrew Millen",
    "title": "Sr. Product Designer / Front-End Developer / Design Engineer"
  },
  "experiences": [
    {
      "organization": "OfficeSpace Software",
      "role": "Sr. Product Designer",
      "dates": "November 2021 – Present",
      "description": [
        "Lead design and implementation of new design system that triples dev velocity, reduces accessibility issues by 70%, and unlocks thousands in new ARR",
        "Work across multiple teams to ship new product features and enhancements, including a suite of business intelligence dashboards that has directly increased NRR and revolutionized data workflows for WEX teams",
        "Deliver at every step of the product development lifecycle, including running UX research, leading design workshops, and providing high fidelity design mockups"
      ]
    },
    {
      "organization": "Simple Focus",
      "role": "Sr. UI/UX Designer",
      "dates": "Oct 2015 – Oct 2021",
      "description": [
        "Oversaw design and dev teams in the production of websites, apps, and real-world experiences, including the implementation of creative growth programs",
        "Designed and built responsive, performant websites and apps on a variety of platforms using React/JS, HTML/CSS, and PHP",
        "Developed additional skills in motion graphics, 3D, and projection mapping to create rich interactive experiences that earned 2 Gold and 4 Silver Addy’s",
        "Worked directly with clients ranging from local non-profits to Fortune-500s"
      ]
    },
    {
      "organization": "HelloHome",
      "role": "Product Designer (Freelance)",
      "dates": "June 2017 – July 2018",
      "description": [
        "Worked directly with startup founder and CTO to bring their vision of an end-to-end real estate sales platform to life from scratch",
        "Created a design system, dozens of user flows, and innovative user interface concepts for initial product launch"
      ]
    },
    {
      "organization": "Red Alloy Creative",
      "role": "Web Designer",
      "dates": "Dec 2013 – Oct 2015",
      "description": [
        "Led discovery, design, and development of web and interactive projects",
        "Expanded service offerings by providing site architecture, content strategy, and brand voice guidelines that enriched the client experience",
        "Helped grow the business from a solo founder to a 3-person team that was later acquired"
      ]
    }
  ],
  "certifications": [
    {
      "provider": "Growth.Design",
      "providerUrl": "https://growth.design/course",
      "certification": "Product Psychology Mastery",
      "date": "July 2021"
    }
  ],
  "community": [
    {
      "name": "AIGA Memphis",
      "role": "Executive Board Member, Director of Communications",
      "date": "2017-2018"
    },
    {
      "name": "Designation",
      "role": "Design Mentor",
      "date": "2016-2017"
    }
  ],
  "education": {
    "school": "Rhodes College",
    "location": "Memphis, Tenn.",
    "major": "English & Creative Writing (Cum Laude)",
    "honors": "Sigma Tau Delta",
    "date": "May 2012"
  }
}
